#For Loop (迴圈)
早餐 = ["三明治","汉堡","叻沙","饭团"]
饮料 = ["菊花","绿茶","红茶","奶茶"]
数量 = 0
#for 餐点 in 早餐:
#↑针对早餐的每个餐点
   #if 餐点 == "汉堡":  
      #break←中断迴圈
   #print(餐点)三明治

#for 餐点 in 早餐:
     #print(餐点)
# 三明治 汉堡 叻沙 饭团

#for 餐点 in 早餐:
     #if 餐点 == "汉堡":  
        #continue←继续
     #print(餐点)三明治 叻沙 饭团

for 餐点 in 早餐:
    for 饮品 in 饮料:
        print(f"{餐点}配{饮品}")
        数量 = 数量 + 1
    print(f"总共有{数量}种套餐组合")
#三明治配菊花 三明治配绿茶 三明治配红茶 三明治配奶茶 汉堡配菊花 汉堡配绿茶 汉堡配奶茶
#总共有8种套餐组合
#叻沙配菊花 叻沙配绿茶 叻沙配红茶 叻沙配奶茶
#总共有12种套餐组合
#饭团配菊花 饭团配绿茶 饭团配红茶 饭团配奶茶
#总共有16种套餐组合
#for 文字 in "早餐店":
    #print(文字)早 餐 店

