#布林資料型態 (Boolean)
牛排 = 50
猪排 = 45
鱼排 = 40
套餐 = 80
餐点 = input("请问你要点什么餐点?(A)猪排 (B)牛排 :").upper()
升级 = input("你是否要升级套餐?(Y)要 (N)不要").upper()
if 餐点 == "A":
    if 升级 == "Y":
       print(f"你的餐点总共是{牛排 + 套餐}块")
    else:
       print(f"你的餐点总共是{牛排}块")
else:
   if 升级 == "Y":
       print(f"你的餐点总共是{猪排 + 套餐}块")
   else:
       print(f"你的餐点总共是{猪排}块")
#.upper()会把接收到的字母一律改成大写
#if 猪排 > 猪排:
    #print("牛排比较贵")
#else:
    #print("猪排比较贵")
#print(牛排(50块) > 猪排(45块))"True"
#print(牛排(50块) < 猪排(45块))"False"
#print(牛排(50块) == 猪排(45块))"False"
#print(牛排(50块) != 猪排(45块))"True"
#print(not 牛排(50块) != 猪排(45块))"False"
#print(not 牛排(50块) == 猪排(45块))"True"
#↑牛排的价格与猪排是否相等
# = 代表把某个值赋予给一个变数
#  == 是“ 计算两者价格之间“是否相等” ”的意思
# ！⌊不等于⌋的意思
# not 反转布林值