#Python 零基礎新手入門 #08 Dictionaries (字典)
手机1 = {
    "厂牌" : "苹果",
    "型号" : "iPhone 14 Pro",
    "容量" : "1 TB",
    "颜色" : "深紫色"
}
手机2 = {
    "厂牌" : "小米",
    "型号" : "13 Pro",
    "容量" : "256 GB",
    "颜色" : "旷野绿（陶瓷）"    
}
手机3 = {
    "厂牌" : "三星",
    "型号" : "Galaxy S23 Ultra",
    "容量" : "512 GB",
    "颜色" : "薰衣草色"  
}
库存 = [手机1,手机2,手机3]
#print(库存[2]["型号"])Galaxy S23 Ultra
查询 = input("请输入要查询的厂牌名称:")
if 查询 in str(库存):
    #str 类型是非常常用和重要的，用于存储和操作文本数据。
    for 手机 in 库存:
        if 手机["厂牌"] == 查询:
            print(f"目前库存中有{手机['颜色']}的{手机['型号']},容量是{手机['容量']}")
            #因为print语法两侧已使用⌈双引号⌋所以里面每一个Key
else:
    print(f"目前没有{查询}手机的库存")