#Python 零基礎新手入門 #07 Function (函式)
def 加法(x,y):
    return x + y
def 减法(x,y):
    return x - y
def 乘法(x,y):
    return x * y
def 除法(x,y):
    商数 = x // y
    余数 = x % y
    return 商数,余数
while True:
    计算类型 = input("请输入计算类型(1)加(2)减(3)乘(4)除(或按其他任意键关闭程式):")
    if 计算类型 in ("1","2","3","4"):
        数字1 = int(input("请输入第一个整数:"))
        数字2 = int(input("请输入第二个整数:"))
        if 计算类型 == "1":
            print(f"{数字1} 加 {数字2} 等于 {加法(数字1,数字2)}")
        elif 计算类型 == "2":
            print(f"{数字1} 减 {数字2} 等于 {减法(数字1,数字2)}")
        elif 计算类型 == "3":
            print(f"{数字1} 乘 {数字2} 等于 {乘法(数字1,数字2)}")
        elif 计算类型 == "4":
            if 数字1 % 数字2 == 0:
                print(f"{数字1} 除以 {数字2} 等于 {除法(数字1,数字2)[0]}")
            else:
                print(f"{数字1} 除以 {数字2} 等于 {除法(数字1,数字2)[0]} 余 {除法(数字1,数字2)[1]}")
    else:
        print("拜拜～")
        break
#print(除法(10,3)[0]) #取出商数
#print(除法(10,3)[1]) #取出余数